; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p5---int100n150-m25---int100c150---s55---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level6 level6)
(sum level0 level12 level12)
(sum level0 level15 level15)
(sum level0 level19 level19)
(sum level0 level22 level22)
(sum level0 level25 level25)
(sum level1 level4 level5)
(sum level1 level6 level7)
(sum level1 level12 level13)
(sum level1 level15 level16)
(sum level1 level19 level20)
(sum level1 level22 level23)
(sum level1 level25 level26)
(sum level2 level4 level6)
(sum level2 level6 level8)
(sum level2 level12 level14)
(sum level2 level15 level17)
(sum level2 level19 level21)
(sum level2 level22 level24)
(sum level2 level25 level27)
(sum level3 level4 level7)
(sum level3 level6 level9)
(sum level3 level12 level15)
(sum level3 level15 level18)
(sum level3 level19 level22)
(sum level3 level22 level25)
(sum level3 level25 level28)
(sum level4 level4 level8)
(sum level4 level6 level10)
(sum level4 level12 level16)
(sum level4 level15 level19)
(sum level4 level19 level23)
(sum level4 level22 level26)
(sum level4 level25 level29)
(sum level5 level4 level9)
(sum level5 level6 level11)
(sum level5 level12 level17)
(sum level5 level15 level20)
(sum level5 level19 level24)
(sum level5 level22 level27)
(sum level5 level25 level30)
(sum level6 level4 level10)
(sum level6 level6 level12)
(sum level6 level12 level18)
(sum level6 level15 level21)
(sum level6 level19 level25)
(sum level6 level22 level28)
(sum level6 level25 level31)
(sum level7 level4 level11)
(sum level7 level6 level13)
(sum level7 level12 level19)
(sum level7 level15 level22)
(sum level7 level19 level26)
(sum level7 level22 level29)
(sum level7 level25 level32)
(sum level8 level4 level12)
(sum level8 level6 level14)
(sum level8 level12 level20)
(sum level8 level15 level23)
(sum level8 level19 level27)
(sum level8 level22 level30)
(sum level8 level25 level33)
(sum level9 level4 level13)
(sum level9 level6 level15)
(sum level9 level12 level21)
(sum level9 level15 level24)
(sum level9 level19 level28)
(sum level9 level22 level31)
(sum level9 level25 level34)
(sum level10 level4 level14)
(sum level10 level6 level16)
(sum level10 level12 level22)
(sum level10 level15 level25)
(sum level10 level19 level29)
(sum level10 level22 level32)
(sum level10 level25 level35)
(sum level11 level4 level15)
(sum level11 level6 level17)
(sum level11 level12 level23)
(sum level11 level15 level26)
(sum level11 level19 level30)
(sum level11 level22 level33)
(sum level11 level25 level36)
(sum level12 level4 level16)
(sum level12 level6 level18)
(sum level12 level12 level24)
(sum level12 level15 level27)
(sum level12 level19 level31)
(sum level12 level22 level34)
(sum level12 level25 level37)
(sum level13 level4 level17)
(sum level13 level6 level19)
(sum level13 level12 level25)
(sum level13 level15 level28)
(sum level13 level19 level32)
(sum level13 level22 level35)
(sum level13 level25 level38)
(sum level14 level4 level18)
(sum level14 level6 level20)
(sum level14 level12 level26)
(sum level14 level15 level29)
(sum level14 level19 level33)
(sum level14 level22 level36)
(sum level14 level25 level39)
(sum level15 level4 level19)
(sum level15 level6 level21)
(sum level15 level12 level27)
(sum level15 level15 level30)
(sum level15 level19 level34)
(sum level15 level22 level37)
(sum level15 level25 level40)
(sum level16 level4 level20)
(sum level16 level6 level22)
(sum level16 level12 level28)
(sum level16 level15 level31)
(sum level16 level19 level35)
(sum level16 level22 level38)
(sum level16 level25 level41)
(sum level17 level4 level21)
(sum level17 level6 level23)
(sum level17 level12 level29)
(sum level17 level15 level32)
(sum level17 level19 level36)
(sum level17 level22 level39)
(sum level17 level25 level42)
(sum level18 level4 level22)
(sum level18 level6 level24)
(sum level18 level12 level30)
(sum level18 level15 level33)
(sum level18 level19 level37)
(sum level18 level22 level40)
(sum level18 level25 level43)
(sum level19 level4 level23)
(sum level19 level6 level25)
(sum level19 level12 level31)
(sum level19 level15 level34)
(sum level19 level19 level38)
(sum level19 level22 level41)
(sum level19 level25 level44)
(sum level20 level4 level24)
(sum level20 level6 level26)
(sum level20 level12 level32)
(sum level20 level15 level35)
(sum level20 level19 level39)
(sum level20 level22 level42)
(sum level20 level25 level45)
(sum level21 level4 level25)
(sum level21 level6 level27)
(sum level21 level12 level33)
(sum level21 level15 level36)
(sum level21 level19 level40)
(sum level21 level22 level43)
(sum level21 level25 level46)
(sum level22 level4 level26)
(sum level22 level6 level28)
(sum level22 level12 level34)
(sum level22 level15 level37)
(sum level22 level19 level41)
(sum level22 level22 level44)
(sum level22 level25 level47)
(sum level23 level4 level27)
(sum level23 level6 level29)
(sum level23 level12 level35)
(sum level23 level15 level38)
(sum level23 level19 level42)
(sum level23 level22 level45)
(sum level23 level25 level48)
(sum level24 level4 level28)
(sum level24 level6 level30)
(sum level24 level12 level36)
(sum level24 level15 level39)
(sum level24 level19 level43)
(sum level24 level22 level46)
(sum level24 level25 level49)
(sum level25 level4 level29)
(sum level25 level6 level31)
(sum level25 level12 level37)
(sum level25 level15 level40)
(sum level25 level19 level44)
(sum level25 level22 level47)
(sum level25 level25 level50)
(sum level26 level4 level30)
(sum level26 level6 level32)
(sum level26 level12 level38)
(sum level26 level15 level41)
(sum level26 level19 level45)
(sum level26 level22 level48)
(sum level26 level25 level51)
(sum level27 level4 level31)
(sum level27 level6 level33)
(sum level27 level12 level39)
(sum level27 level15 level42)
(sum level27 level19 level46)
(sum level27 level22 level49)
(sum level27 level25 level52)
(sum level28 level4 level32)
(sum level28 level6 level34)
(sum level28 level12 level40)
(sum level28 level15 level43)
(sum level28 level19 level47)
(sum level28 level22 level50)
(sum level28 level25 level53)
(sum level29 level4 level33)
(sum level29 level6 level35)
(sum level29 level12 level41)
(sum level29 level15 level44)
(sum level29 level19 level48)
(sum level29 level22 level51)
(sum level29 level25 level54)
(sum level30 level4 level34)
(sum level30 level6 level36)
(sum level30 level12 level42)
(sum level30 level15 level45)
(sum level30 level19 level49)
(sum level30 level22 level52)
(sum level30 level25 level55)
(sum level31 level4 level35)
(sum level31 level6 level37)
(sum level31 level12 level43)
(sum level31 level15 level46)
(sum level31 level19 level50)
(sum level31 level22 level53)
(sum level31 level25 level56)
(sum level32 level4 level36)
(sum level32 level6 level38)
(sum level32 level12 level44)
(sum level32 level15 level47)
(sum level32 level19 level51)
(sum level32 level22 level54)
(sum level32 level25 level57)
(sum level33 level4 level37)
(sum level33 level6 level39)
(sum level33 level12 level45)
(sum level33 level15 level48)
(sum level33 level19 level52)
(sum level33 level22 level55)
(sum level33 level25 level58)
(sum level34 level4 level38)
(sum level34 level6 level40)
(sum level34 level12 level46)
(sum level34 level15 level49)
(sum level34 level19 level53)
(sum level34 level22 level56)
(sum level34 level25 level59)
(sum level35 level4 level39)
(sum level35 level6 level41)
(sum level35 level12 level47)
(sum level35 level15 level50)
(sum level35 level19 level54)
(sum level35 level22 level57)
(sum level35 level25 level60)
(sum level36 level4 level40)
(sum level36 level6 level42)
(sum level36 level12 level48)
(sum level36 level15 level51)
(sum level36 level19 level55)
(sum level36 level22 level58)
(sum level36 level25 level61)
(sum level37 level4 level41)
(sum level37 level6 level43)
(sum level37 level12 level49)
(sum level37 level15 level52)
(sum level37 level19 level56)
(sum level37 level22 level59)
(sum level37 level25 level62)
(sum level38 level4 level42)
(sum level38 level6 level44)
(sum level38 level12 level50)
(sum level38 level15 level53)
(sum level38 level19 level57)
(sum level38 level22 level60)
(sum level38 level25 level63)
(sum level39 level4 level43)
(sum level39 level6 level45)
(sum level39 level12 level51)
(sum level39 level15 level54)
(sum level39 level19 level58)
(sum level39 level22 level61)
(sum level39 level25 level64)
(sum level40 level4 level44)
(sum level40 level6 level46)
(sum level40 level12 level52)
(sum level40 level15 level55)
(sum level40 level19 level59)
(sum level40 level22 level62)
(sum level40 level25 level65)
(sum level41 level4 level45)
(sum level41 level6 level47)
(sum level41 level12 level53)
(sum level41 level15 level56)
(sum level41 level19 level60)
(sum level41 level22 level63)
(sum level41 level25 level66)
(sum level42 level4 level46)
(sum level42 level6 level48)
(sum level42 level12 level54)
(sum level42 level15 level57)
(sum level42 level19 level61)
(sum level42 level22 level64)
(sum level42 level25 level67)
(sum level43 level4 level47)
(sum level43 level6 level49)
(sum level43 level12 level55)
(sum level43 level15 level58)
(sum level43 level19 level62)
(sum level43 level22 level65)
(sum level43 level25 level68)
(sum level44 level4 level48)
(sum level44 level6 level50)
(sum level44 level12 level56)
(sum level44 level15 level59)
(sum level44 level19 level63)
(sum level44 level22 level66)
(sum level44 level25 level69)
(sum level45 level4 level49)
(sum level45 level6 level51)
(sum level45 level12 level57)
(sum level45 level15 level60)
(sum level45 level19 level64)
(sum level45 level22 level67)
(sum level45 level25 level70)
(sum level46 level4 level50)
(sum level46 level6 level52)
(sum level46 level12 level58)
(sum level46 level15 level61)
(sum level46 level19 level65)
(sum level46 level22 level68)
(sum level46 level25 level71)
(sum level47 level4 level51)
(sum level47 level6 level53)
(sum level47 level12 level59)
(sum level47 level15 level62)
(sum level47 level19 level66)
(sum level47 level22 level69)
(sum level47 level25 level72)
(sum level48 level4 level52)
(sum level48 level6 level54)
(sum level48 level12 level60)
(sum level48 level15 level63)
(sum level48 level19 level67)
(sum level48 level22 level70)
(sum level48 level25 level73)
(sum level49 level4 level53)
(sum level49 level6 level55)
(sum level49 level12 level61)
(sum level49 level15 level64)
(sum level49 level19 level68)
(sum level49 level22 level71)
(sum level49 level25 level74)
(sum level50 level4 level54)
(sum level50 level6 level56)
(sum level50 level12 level62)
(sum level50 level15 level65)
(sum level50 level19 level69)
(sum level50 level22 level72)
(sum level50 level25 level75)
(sum level51 level4 level55)
(sum level51 level6 level57)
(sum level51 level12 level63)
(sum level51 level15 level66)
(sum level51 level19 level70)
(sum level51 level22 level73)
(sum level51 level25 level76)
(sum level52 level4 level56)
(sum level52 level6 level58)
(sum level52 level12 level64)
(sum level52 level15 level67)
(sum level52 level19 level71)
(sum level52 level22 level74)
(sum level52 level25 level77)
(sum level53 level4 level57)
(sum level53 level6 level59)
(sum level53 level12 level65)
(sum level53 level15 level68)
(sum level53 level19 level72)
(sum level53 level22 level75)
(sum level53 level25 level78)
(sum level54 level4 level58)
(sum level54 level6 level60)
(sum level54 level12 level66)
(sum level54 level15 level69)
(sum level54 level19 level73)
(sum level54 level22 level76)
(sum level54 level25 level79)
(sum level55 level4 level59)
(sum level55 level6 level61)
(sum level55 level12 level67)
(sum level55 level15 level70)
(sum level55 level19 level74)
(sum level55 level22 level77)
(sum level55 level25 level80)
(sum level56 level4 level60)
(sum level56 level6 level62)
(sum level56 level12 level68)
(sum level56 level15 level71)
(sum level56 level19 level75)
(sum level56 level22 level78)
(sum level56 level25 level81)
(sum level57 level4 level61)
(sum level57 level6 level63)
(sum level57 level12 level69)
(sum level57 level15 level72)
(sum level57 level19 level76)
(sum level57 level22 level79)
(sum level57 level25 level82)
(sum level58 level4 level62)
(sum level58 level6 level64)
(sum level58 level12 level70)
(sum level58 level15 level73)
(sum level58 level19 level77)
(sum level58 level22 level80)
(sum level58 level25 level83)
(sum level59 level4 level63)
(sum level59 level6 level65)
(sum level59 level12 level71)
(sum level59 level15 level74)
(sum level59 level19 level78)
(sum level59 level22 level81)
(sum level59 level25 level84)
(sum level60 level4 level64)
(sum level60 level6 level66)
(sum level60 level12 level72)
(sum level60 level15 level75)
(sum level60 level19 level79)
(sum level60 level22 level82)
(sum level60 level25 level85)
(sum level61 level4 level65)
(sum level61 level6 level67)
(sum level61 level12 level73)
(sum level61 level15 level76)
(sum level61 level19 level80)
(sum level61 level22 level83)
(sum level61 level25 level86)
(sum level62 level4 level66)
(sum level62 level6 level68)
(sum level62 level12 level74)
(sum level62 level15 level77)
(sum level62 level19 level81)
(sum level62 level22 level84)
(sum level62 level25 level87)
(sum level63 level4 level67)
(sum level63 level6 level69)
(sum level63 level12 level75)
(sum level63 level15 level78)
(sum level63 level19 level82)
(sum level63 level22 level85)
(sum level63 level25 level88)
(sum level64 level4 level68)
(sum level64 level6 level70)
(sum level64 level12 level76)
(sum level64 level15 level79)
(sum level64 level19 level83)
(sum level64 level22 level86)
(sum level64 level25 level89)
(sum level65 level4 level69)
(sum level65 level6 level71)
(sum level65 level12 level77)
(sum level65 level15 level80)
(sum level65 level19 level84)
(sum level65 level22 level87)
(sum level65 level25 level90)
(sum level66 level4 level70)
(sum level66 level6 level72)
(sum level66 level12 level78)
(sum level66 level15 level81)
(sum level66 level19 level85)
(sum level66 level22 level88)
(sum level66 level25 level91)
(sum level67 level4 level71)
(sum level67 level6 level73)
(sum level67 level12 level79)
(sum level67 level15 level82)
(sum level67 level19 level86)
(sum level67 level22 level89)
(sum level67 level25 level92)
(sum level68 level4 level72)
(sum level68 level6 level74)
(sum level68 level12 level80)
(sum level68 level15 level83)
(sum level68 level19 level87)
(sum level68 level22 level90)
(sum level68 level25 level93)
(sum level69 level4 level73)
(sum level69 level6 level75)
(sum level69 level12 level81)
(sum level69 level15 level84)
(sum level69 level19 level88)
(sum level69 level22 level91)
(sum level69 level25 level94)
(sum level70 level4 level74)
(sum level70 level6 level76)
(sum level70 level12 level82)
(sum level70 level15 level85)
(sum level70 level19 level89)
(sum level70 level22 level92)
(sum level70 level25 level95)
(sum level71 level4 level75)
(sum level71 level6 level77)
(sum level71 level12 level83)
(sum level71 level15 level86)
(sum level71 level19 level90)
(sum level71 level22 level93)
(sum level71 level25 level96)
(sum level72 level4 level76)
(sum level72 level6 level78)
(sum level72 level12 level84)
(sum level72 level15 level87)
(sum level72 level19 level91)
(sum level72 level22 level94)
(sum level72 level25 level97)
(sum level73 level4 level77)
(sum level73 level6 level79)
(sum level73 level12 level85)
(sum level73 level15 level88)
(sum level73 level19 level92)
(sum level73 level22 level95)
(sum level73 level25 level98)
(sum level74 level4 level78)
(sum level74 level6 level80)
(sum level74 level12 level86)
(sum level74 level15 level89)
(sum level74 level19 level93)
(sum level74 level22 level96)
(sum level74 level25 level99)
(sum level75 level4 level79)
(sum level75 level6 level81)
(sum level75 level12 level87)
(sum level75 level15 level90)
(sum level75 level19 level94)
(sum level75 level22 level97)
(sum level75 level25 level100)
(sum level76 level4 level80)
(sum level76 level6 level82)
(sum level76 level12 level88)
(sum level76 level15 level91)
(sum level76 level19 level95)
(sum level76 level22 level98)
(sum level76 level25 level101)
(sum level77 level4 level81)
(sum level77 level6 level83)
(sum level77 level12 level89)
(sum level77 level15 level92)
(sum level77 level19 level96)
(sum level77 level22 level99)
(sum level77 level25 level102)
(sum level78 level4 level82)
(sum level78 level6 level84)
(sum level78 level12 level90)
(sum level78 level15 level93)
(sum level78 level19 level97)
(sum level78 level22 level100)
(sum level78 level25 level103)
(sum level79 level4 level83)
(sum level79 level6 level85)
(sum level79 level12 level91)
(sum level79 level15 level94)
(sum level79 level19 level98)
(sum level79 level22 level101)
(sum level79 level25 level104)
(sum level80 level4 level84)
(sum level80 level6 level86)
(sum level80 level12 level92)
(sum level80 level15 level95)
(sum level80 level19 level99)
(sum level80 level22 level102)
(sum level80 level25 level105)
(sum level81 level4 level85)
(sum level81 level6 level87)
(sum level81 level12 level93)
(sum level81 level15 level96)
(sum level81 level19 level100)
(sum level81 level22 level103)
(sum level81 level25 level106)
(sum level82 level4 level86)
(sum level82 level6 level88)
(sum level82 level12 level94)
(sum level82 level15 level97)
(sum level82 level19 level101)
(sum level82 level22 level104)
(sum level83 level4 level87)
(sum level83 level6 level89)
(sum level83 level12 level95)
(sum level83 level15 level98)
(sum level83 level19 level102)
(sum level83 level22 level105)
(sum level84 level4 level88)
(sum level84 level6 level90)
(sum level84 level12 level96)
(sum level84 level15 level99)
(sum level84 level19 level103)
(sum level84 level22 level106)
(sum level85 level4 level89)
(sum level85 level6 level91)
(sum level85 level12 level97)
(sum level85 level15 level100)
(sum level85 level19 level104)
(sum level86 level4 level90)
(sum level86 level6 level92)
(sum level86 level12 level98)
(sum level86 level15 level101)
(sum level86 level19 level105)
(sum level87 level4 level91)
(sum level87 level6 level93)
(sum level87 level12 level99)
(sum level87 level15 level102)
(sum level87 level19 level106)
(sum level88 level4 level92)
(sum level88 level6 level94)
(sum level88 level12 level100)
(sum level88 level15 level103)
(sum level89 level4 level93)
(sum level89 level6 level95)
(sum level89 level12 level101)
(sum level89 level15 level104)
(sum level90 level4 level94)
(sum level90 level6 level96)
(sum level90 level12 level102)
(sum level90 level15 level105)
(sum level91 level4 level95)
(sum level91 level6 level97)
(sum level91 level12 level103)
(sum level91 level15 level106)
(sum level92 level4 level96)
(sum level92 level6 level98)
(sum level92 level12 level104)
(sum level93 level4 level97)
(sum level93 level6 level99)
(sum level93 level12 level105)
(sum level94 level4 level98)
(sum level94 level6 level100)
(sum level94 level12 level106)
(sum level95 level4 level99)
(sum level95 level6 level101)
(sum level96 level4 level100)
(sum level96 level6 level102)
(sum level97 level4 level101)
(sum level97 level6 level103)
(sum level98 level4 level102)
(sum level98 level6 level104)
(sum level99 level4 level103)
(sum level99 level6 level105)
(sum level100 level4 level104)
(sum level100 level6 level106)
(sum level101 level4 level105)
(sum level102 level4 level106)

(connected l0 l2)
(fuelcost level6 l0 l2)
(connected l0 l3)
(fuelcost level22 l0 l3)
(connected l0 l4)
(fuelcost level12 l0 l4)
(connected l1 l2)
(fuelcost level4 l1 l2)
(connected l2 l0)
(fuelcost level6 l2 l0)
(connected l2 l1)
(fuelcost level4 l2 l1)
(connected l2 l3)
(fuelcost level19 l2 l3)
(connected l2 l4)
(fuelcost level25 l2 l4)
(connected l3 l0)
(fuelcost level22 l3 l0)
(connected l3 l2)
(fuelcost level19 l3 l2)
(connected l3 l4)
(fuelcost level15 l3 l4)
(connected l4 l0)
(fuelcost level12 l4 l0)
(connected l4 l2)
(fuelcost level25 l4 l2)
(connected l4 l3)
(fuelcost level15 l4 l3)

(at t0 l4)
(fuel t0 level106)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
(at p2 l0)
(at p3 l3)
(at p4 l3)
)

(:goal
(and
(at p0 l2)
(at p1 l4)
(at p2 l3)
(at p3 l4)
(at p4 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l4 l0 level94 level12 level106)
   deleted: (at t0 l4) (fuel t0 level106)
   added: (at t0 l0) (fuel t0 level94)
   goals met: 0 of 5
2. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 5
3. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 5
4. (drive t0 l0 l3 level72 level22 level94)
   deleted: (at t0 l0) (fuel t0 level94)
   added: (at t0 l3) (fuel t0 level72)
   goals met: 0 of 5
5. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 1 of 5
6. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 1 of 5
7. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 1 of 5
8. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 1 of 5
9. (drive t0 l3 l4 level57 level15 level72)
   deleted: (at t0 l3) (fuel t0 level72)
   added: (at t0 l4) (fuel t0 level57)
   goals met: 1 of 5
10. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 2 of 5
11. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 3 of 5
12. (drive t0 l4 l2 level32 level25 level57)
   deleted: (at t0 l4) (fuel t0 level57)
   added: (at t0 l2) (fuel t0 level32)
   goals met: 3 of 5
13. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 4 of 5
14. (drive t0 l2 l1 level28 level4 level32)
   deleted: (at t0 l2) (fuel t0 level32)
   added: (at t0 l1) (fuel t0 level28)
   goals met: 4 of 5
15. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 5 of 5
